//=======================================================================================
//!	@file	:	PCM.cpp
//!	@brief	:	PCMクラスのメンバ関数宣言
//!	@author	:	Toru Wakabayashi
//!	@date	:	2015/07/23
//=======================================================================================
#include "Audio.h"
#include "PCM.h"
using namespace Chocolat;
using namespace PCM;

//-------------------------------------------------------------
//!	@brief	: PCMデータの解析
//!	@note	: チャンネルやビットレート等の情報を取得する
//-------------------------------------------------------------
void PCMData::analyze()
{
//    m_BitSample = m_BlockAlignment
}

//-------------------------------------------------------------
//!	@brief	: PCMデータの再構築
//!	@note	: Rawデータを受け取ってWavファイルとしてバイナリデータを構成する
//-------------------------------------------------------------
void PCMData::reconstruction()
{
    
}